{
  "theme1": {
    "theme": "用户洞察 & 需求分析",
    "questions": [
      {
        "q": "一款 AI 语音助手要进入 K12 教育市场，你会如何确定它的第一批目标用户？",
        "a": "首先把市场按多维度切分：按年龄段（小学高年级/初中/高中）、按场景（课堂辅导/自学/课后作业）、按决策者（学生/家长/学校/机构）和付费能力（高付费意愿/免费用户）。优先策略是聚焦一个高频、付费意愿强且易规模化的细分市场，例如准备中高考的初高中学生及其家长或与校外补习机构合作的学员。验证方法包括：1) 定量调研（问卷/第三方数据）估算TAM与付费意愿；2) 深度访谈与课堂观察获取真实痛点；3) 小范围试点（与1-2家补习机构或班级合作）观察激活、留存与付费转化。MVP可先覆盖典型场景（例如英语听力/口语练习+即时评分、错题讲解与学习路径追踪），关键指标设为激活率、7/30日留存、课程完成率与付费转化率。风险与对策包括数据隐私合规（优先做家长同意流程）、模型学科偏差（先做少量学科微调）和运营获客策略（与机构渠道合作降低CAC）。"
      },
      {
        "q": "公司让你调研 AI 写作助手在小红书博主中的需求，你会怎么拆解调研对象？",
        "a": "把创作者按垂类（美妆/穿搭/美食/旅行/职场等）、产出频率（职业创作者/兼职/偶发）、变现方式（带货/接单/导流）和写作能力（擅长写作/需要大量编辑）进行分层。对每层分别梳理工作流痛点：选题、开头吸引、配图要求、改稿次数及时间成本、平台曝光期待和商业需求。调研方法组合：广覆盖的问卷量化常见痛点与付费意愿；深度访谈挖掘真实场景与工作流；样本内容分析（看改稿量、标题与首句结构）验证假设。基于结果设计功能候选：一键写稿/多风格备选/标题与tag优化/排期与复用模板。验证商业价值通过A/B测试生成内容与人工内容在曝光与互动上的差异，并用小规模付费试用验证付费意愿。"
      },
      {
        "q": "如果你发现用户说“生成的图太假”，你会如何区分这是 真实痛点 还是 伪需求？",
        "a": "先具体化‘太假’的含义，通过问卷与访谈让用户给出可观察的例子（如肤色偏差、细节不自然、表情僵硬）并明确使用场景（发布到平台/内部草稿/商业客户交付）。判断标准：如果这种‘太假’会直接导致下游损失（降低点击率/被平台判定/客户拒稿），则是真痛点；若只是主观审美偏好且不影响效果，可能是伪需求。用可验证实验证明：做盲测或A/B测试比较真实照片与生成图在CTR/点赞/转化上的差异，或用主观评测量表统计满意度。解决方案包括提供真实度调节、风格化选项、针对发布场景的模型微调和让用户可快速后处理（修图工具）。关键成功指标应包括发表后互动变化、用户主观评分与退稿率。"
      },
      {
        "q": "如何判断一个需求是“刚需”还是“锦上添花”？请举例。",
        "a": "使用频率、痛点严重性和可替代性作为判断维度。具体做法：1) 量化频率（每天/每周发生多少次）；2) 评估痛点严重性（是否阻碍核心目标达成）；3) 看是否有低成本替代方案。工具上可用Kano模型识别基本属性、期望属性与魅力属性，也可用RICE/ICE量化优先级。举例：打车软件的实时ETA属于刚需（影响是否下单），而界面皮肤主题通常为锦上添花（不影响下单）。在实践中，优先把刚需做稳，锦上添花在有资源时迭代。"
      },
      {
        "q": "给你一个场景：外卖平台要推出 AI 智能客服，你会如何界定 核心使用场景？",
        "a": "先做数据驱动的场景识别：分析历史客服工单与聊天日志，找出占比最高且标准化的问题（例如订单状态查询、配送延迟、退款/退餐、地址修改）。核心场景应满足三个条件：高频、容易标准化自动处理且自动化收益显著。定义边界：AI 负责标准化、可快速自动化的问题，多轮对话能力承接并能在必要时无缝转人工；复杂争议或需人工判定的场景触发人工工单。KPI含自动解决率、首问解决率、平均处理时长、人工转接率及CSAT。实施路径为先做FAQ+意图识别，再训练多轮对话槽位填充，最后做上线灰度与持续迭代。"
      },
      {
        "q": "用户经常说“我想要更智能”，你会如何把模糊的需求转化为可执行的产品功能？",
        "a": "首先用‘为什么-为什么’深入追问来拆解真实目标：比如是希望节省操作步骤、提升结果准确性、还是获得个性化推荐。把需求转化为Job-to-be-done（用户要完成的具体任务），然后列出可衡量的能力假设（如上下文记忆、多轮理解、预测用户意图）。对每个假设设计小型POC或A/B实验验证，并定义成功指标（如任务完成率上升、操作步数下降、满意度提升）。在产品上把‘智能’拆成可配置的功能模块（如历史记忆、个性化模板、智能补全），并把默认体验简化以降低认知成本。"
      },
      {
        "q": "如果你发现不同用户群的需求冲突（比如效率 vs. 精细度），你会如何取舍？",
        "a": "第一步是分层用户群并量化每一类的市场规模和LTV，评估谁对业务目标贡献最大。常见策略包括可配置化（提供‘极速模式’与‘精细模式’）、progressive disclosure（默认简洁、为高级用户开放复杂设置）或分产品线（为不同用户做不同产品）。决策框架是衡量实现成本、对关键指标（留存/付费/口碑）的影响以及竞争环境。优先级应结合公司战略：若需要快速用户增长，优先效率；若要深度付费或企业客户，优先精细度。最终用小范围实验验证选择的效果并据结果调整。"
      }
    ]
  },
  "theme2": {
    "theme": "业务逻辑 & 指标思维",
    "questions": [
      {
        "q": "你要为一个 AI 视频生成工具做商业化，第一阶段你的 KPI 会设定成什么？",
        "a": "商业化初期应聚焦能反映产品价值交付与付费意愿的指标：1) 激活率（首次生成并对结果满意的用户比例）表示产品能交付核心价值；2) 试用到付费转化率衡量商业化能力；3) ARPU或ARPPU反映单用户付费水平；4) 留存（7/30日）衡量长期价值；5) 单视频边际成本与毛利率关注单位经济性。并行做价格实验以找到最优定价模型（订阅、按次付费或企业套餐），用CAC/LTV与回收期来评估可扩展性。"
      },
      {
        "q": "如果公司目标是提升留存，你会从哪些产品角度去思考？",
        "a": "先定位流失漏斗节点（注册→激活→核心行为→复用），找出最大掉点并设计针对性改进。核心产品手段包括：改进首次体验确保Aha moment出现（更好的Onboarding/模板/示例）、降低使用摩擦、增强个性化推荐与内容/模板库、引入成长体系或周期性任务形成习惯、以及增强社交/分享机制提高粘性。同时需要通过AB测试验证每个改动对次日/7日/30日留存的实际提升，并衡量对营收的间接贡献。"
      },
      {
        "q": "当业务目标是“日活增长”，你会如何把它拆解成可衡量的产品指标？",
        "a": "把DAU拆解为漏斗：新增用户（获客）→激活用户（完成首个关键动作）→留存→回访频率。针对每步设定可量化的KPI与增长策略，例如提升激活率（优化新手引导）、提高留存（产品内钩子与通知）、增加回访频率（每日任务/内容更新）和提升传播系数（邀请/分享率）。对每个策略设计实验并设置显著性阈值，按影响估算其对DAU的边际贡献，从而决定优先级与资源分配。"
      },
      {
        "q": "假设你要设计一个 AI 文章改写工具，如何判断它是否有商业价值？",
        "a": "评估商业价值需证明工具带来的效率提升或效果提升能转化为付费意愿或替代成本。步骤包括：1) 明确目标用户（内容团队/学生/自媒体）；2) 测量基线工作量（平均写作时间/人工成本）；3) 估算改写工具能节省的时间或提高的转化（如阅读/转化率）；4) 用小规模付费试点或pricing experiments测试付费意愿；5) 观察关键指标（生成后编辑时间、发布频率、内容质量/转化）。若能证明LTV提升或显著节省成本，就具备商业化潜力。"
      },
      {
        "q": "如果投资人问“你们的产品护城河是什么”，你会如何回答？",
        "a": "针对AI产品，护城河通常来自数据+模型+分发三方面。我会回答：我们的护城河是“专属行业级数据闭环+持续在线微调能力+渠道集成”。具体而言，我们通过与合作机构/客户的深度集成持续收集高质量交互与业务数据，用于微调模型，形成对特定垂类的显著质量优势；同时我们把产品嵌入客户工作流（API/平台集成）降低切换成本；加之产品体验与客户成功团队形成服务壁垒。这三个要素组合使得竞争者难以在短期内复制。"
      },
      {
        "q": "一个功能能提高转化率，但会降低留存率，你会如何决策？",
        "a": "先量化影响的长期经济价值：计算该功能带来的增量转化所增加的LTV与因留存下降导致的LTV损失，比较净效益。若净效益为正且可回收CAC且提升短期营收关键，考虑有条件上线（灰度/分段用户）。另外也探索优化方案以减少负面影响（例如针对性展示给高转换但低留存风险的用户、提供开关或改进体验）。建议先做小规模实验验证，再根据长期指标决定是否全面推广。"
      },
      {
        "q": "如果产品上线后 DAU 没有增长，你会如何定位问题？",
        "a": "按漏斗逐层排查：检查获客是否下滑（投放/渠道问题）、激活是否到位（新用户是否看到Aha moment）、核心体验是否退化（功能Bug/性能问题）、以及是否有外部因素（竞品活动/季节性）。数据上看事件序列与伴随指标变化，结合客服日志做质性反馈。对每个假设设计验证方法（埋点、热图、用户访谈、AB测试），优先修复高影响且低成本的点。若是市场问题，考虑加大获客或促活投入并优化产品差异化。"
      }
    ]
  },
  "theme3": {
    "theme": "产品设计 & MVP 思维",
    "questions": [
      {
        "q": "你要设计一个 AI 视频剪辑工具，第一版 MVP 只保留哪些功能？为什么？",
        "a": "MVP应聚焦能直接证明‘节省编辑时间并能产生可发布内容’的最小功能集。建议保留：1) 自动素材导入与基于脚本或音乐的一键切分；2) 若干高质量模板（转场/字幕/配乐）实现一键套用；3) 智能镜头选择与裁剪（基于人脸/动作）；4) 一键导出与基础编码优化。避免复杂多轨手动调色或高级VFX。这样能在最短时间验证核心价值（缩短编辑时长、提高完成率），快速获取用户反馈并迭代。"
      },
      {
        "q": "你在设计一个 AI 面试助手时，如何定义“最小可用版本”？",
        "a": "最小可用版本要满足核心承诺：帮助用户练习并获得可执行的改进建议。关键功能包括：1) 语音录入与高准确率转写；2) 题库与随机抽题机制；3) 自动评分体系（逻辑/结构/时长/关键词覆盖）和结构化、可执行的改进建议；4) 保存历史记录与对比数据。保证转写与评价的稳定性比功能多样更重要。衡量指标是用户完成一次模拟面试后的改进幅度、复访率与主观满意度。"
      },
      {
        "q": "如果团队资源有限，功能优先级应该如何排序？请说出你的方法论。",
        "a": "推荐使用量化的优先级框架如RICE（Reach、Impact、Confidence、Effort）或ICE，对每个候选功能估算影响覆盖度、预期影响、实现信心与工作量并计算得分。流程为：列清单→估分→排序→识别依赖项→安排最小可证明价值的迭代。同时把不确定高影响项拆成POC/实验以降低风险。保持与商业/运营对齐，优先支持公司短中期目标的功能。"
      },
      {
        "q": "假设你发现用户对功能满意，但使用频率不高，你会如何优化？",
        "a": "说明价值是‘有用但不常用’。策略是把功能嵌入到用户的日常工作流或制造回访触发：1) 给出日常化使用场景或任务（例如周/日任务、提醒）；2) 通过推送/邮件/内置通知提醒用户；3) 提供模板库或可复用的产出降低再次进入门槛；4) 改善入口（插件/集成到常用工具）把功能变成常用工具的一部分。用A/B测试验证各种触发方式对活跃度的提升。"
      },
      {
        "q": "给你一个场景：电商平台要用 AI 做商品推荐，你会如何设计第一版？",
        "a": "第一版采取务实的混合策略：1) 冷启动阶段用基于规则与商品热度的模块保证覆盖；2) 基于协同过滤或简化的基于内容模型做个性化；3) 在商品详情页与首页首页模块分别展示‘为你推荐/相似热卖/搭配购买’三个简洁模块以便衡量不同策略效果；4) 同时埋点关键事件（点击/加入购物车/转化）用于在线学习。关键指标是推荐CTR、转化率提升与GMV增量。注意确保多样性和避免长尾被忽视的反馈回路。"
      },
      {
        "q": "如果竞品已经推出了相同的功能，你会如何差异化设计？",
        "a": "差异化可以从细分场景、数据深度、体验与渠道四方面入手：1) 垂直化/行业化（针对特定人群或长尾场景做深度微调）；2) 数据闭环（通过与客户/渠道集成获取专有数据做持续优化）；3) UX差异（更低摩擦、更快速度、一键集成工作流）；4) 商业模式（不同价格/打包方案、开放API）。执行时优先选择可快速显著提升用户感受的点，例如速度与成品质量，然后通过案例与渠道强化护城河。"
      },
      {
        "q": "当用户提出一堆功能需求时，你会如何判断哪些要立刻做、哪些可以放弃？",
        "a": "建立清晰的评价标准：业务价值（收入/活跃/战略）、用户价值（影响人数/痛苦程度）、实现成本（开发/维护）和时间敏感性。把所有请求量化打分（RICE/ICE），并把复杂需求拆成小实验验证核心假设。对外沟通时给出明确的‘做/暂缓/拒绝’理由与时间窗口，记录未做需求以便后续回检，从而保持决策透明与可复查。"
      }
    ]
  },
  "theme4": {
    "theme": "技术理解 & 产品叙事",
    "questions": [
      {
        "q": "你要用大模型做 AI 翻译，如何在 PRD 里描述对模型的基本需求？",
        "a": "在PRD写明可测试且可验收的要求：支持的语言对与字符集、质量指标（自动评价如BLEU/chrF及人工评估门槛）、响应时延与吞吐（例如平均响应<500ms或批量吞吐多少）、鲁棒性（置信度阈值下的错误率上限）、退化策略（模型不可用时的回退）、隐私与数据保留策略（是否保留用户文本）、更新频率与回滚流程、成本预算以及验收用例（给定样本集需达到的分数）。同时标注可交付的样例与监控指标以便上线后快速判定质量。"
      },
      {
        "q": "如果研发告诉你“技术做不到”，你会如何判断是真的做不到，还是优先级不够？",
        "a": "要把模糊答案转成具体事实：要求研发列出无法实现的具体技术障碍（性能/数据/依赖/成本）並给出定量估计与替代方案。判断路径：1) 让研发明确定义‘做不到’的约束条件与估算成本；2) 请求POC/原型或有限功能的降级方案以验证是否可行；3) 若确实技术壁垒，评估是否通过外包/采购/合作解决或调整产品边界；4) 若只是优先级问题，基于商业价值与策略推动资源重新分配。整个过程基于数据而非直觉，必要时召集架构师与产品/业务共同评估并形成记录。"
      },
      {
        "q": "给你一个场景：公司要做一个 AI 数字人直播工具，你需要考虑哪些技术约束？",
        "a": "关键约束包括实时性（端到端延迟需控制）、合成质量（嘴型同步、表情自然、语音自然度）、并发与成本（实时渲染GPU负载与并发用户数）、稳定性与降级（网络波动时的回退策略）、数据与合规（肖像权/语音授权、深度伪造风险）、多模态同步（音视频帧同步、字幕与交互）、以及内容安全（实时审核与违规过滤）。在PRD里需定义目标指标如延迟上限、帧率、ASR/TTS准确率与MOS分数，并列出可行的分阶段方案（低延迟小模型＋高质量离线渲染）与回退策略。"
      },
      {
        "q": "在 PRD 中，你如何让研发理解清楚功能边界？",
        "a": "用结构化的方式描述：1) 用户故事与主流程；2) 接受条件（Acceptance Criteria），用可测试的条目说明功能行为；3) API/数据契约（输入/输出/错误码/样例）；4) 非功能需求（性能/安全/错误率）；5) 非目标项（Non-Goals）明确哪些不做；6) 边缘场景与异常流程列清楚。配合交互原型与流程图，提供示例数据与测试集，确保双方对‘做/不做’有共同理解并可按验收标准交付。"
      },
      {
        "q": "假设你要对外介绍一个 AI 视频工具，如何用一句话说清楚它的价值？",
        "a": "使用公式‘我们帮助[目标用户]通过[核心能力]在[时间尺度]内实现[关键收益]’。例如：‘我们帮助内容创作者通过一键智能剪辑与风格模板，在10分钟内产出可发布短视频，从而把制作时间缩短90%并提升播放率。’一句话要明确用户、能力、时间和量化收益，便于传播与记忆。"
      },
      {
        "q": "如果老板要求你在发布会上讲“产品故事”，你会从哪些角度来构建叙事？",
        "a": "构建发布叙事建议按‘Hook→Problem→Solution→Evidence→Vision→CTA’的结构：开场Hook用一个强烈的用户场景或痛点引起共鸣；阐述现有解决方案的不足与市场洞察；介绍我们的解决方案和核心差异化能力，用演示突出产品Aha moment；用数据或客户案例做证据；展望未来与路线图展示长期价值；最后明确CTA（如何试用/购买）。全程保持故事化，穿插真实用户案例与量化数据增强可信度。"
      },
      {
        "q": "当用户说“这个功能没价值”，但你认为它对长期战略有意义，你会如何沟通？",
        "a": "先尊重用户反馈并收集具体原因（使用场景、阻碍、痛点），然后把战略性价值用数据与假设链条拆解给stakeholder：展示该功能如何影响长期指标（留存/进入新市场/建立技术壁垒），并提出可行的验证方案（小范围试点、A/B测试或B2B先行试点）以快速获取证据。若资源有限，建议采用分阶段验证和最小可行实现以降低风险，并在沟通中同时展示短期收益与长期愿景。如果试验失败，保留实现方案以便未来复用并说明退出条件。"
      }
    ]
  }
}
